In [2]:
from sqlalchemy import create_engine
my_conn = create_engine("sqlite:////content/my_db.db")

In [3]:
r_set=my_conn.execute('''select name from sqlite_master where type = 'table' ''')
for row in r_set:
  print (row)

('category',)
('subcategory',)
('student',)

In [4]:
q="SELECT id, name, class, mark, sex FROM student WHERE class='Four'"
my_cursor=my_conn.execute(q)
for row in my_cursor:
  print(row)

(1, 'John Deo', 'Four', 75, 'female')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(10, 'Big John', 'Four', 55, 'female')
(15, 'Tade Row', 'Four', 88, 'male')
(16, 'Gimmy', 'Four', 88, 'male')
(21, 'Babby John', 'Four', 69, 'female')
(31, 'Marry Toeey', 'Four', 88, 'male')

In [5]:
r_set=my_conn.execute('''SELECT * from student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 75, 'female')
(2, 'Max Ruin', 'Three', 85, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(7, 'My John Rob', 'Five', 78, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(10, 'Big John', 'Four', 55, 'female')
(11, 'Ronald', 'Six', 89, 'female')
(12, 'Recky', 'Six', 94, 'female')
(13, 'Kty', 'Seven', 88, 'female')
(14, 'Bigy', 'Seven', 88, 'female')
(15, 'Tade Row', 'Four', 88, 'male')
(16, 'Gimmy', 'Four', 88, 'male')
(17, 'Tumyu', 'Six', 54, 'male')
(18, 'Honny', 'Five', 75, 'male')
(19, 'Tinny', 'Nine', 18, 'male')
(20, 'Jackly', 'Nine', 65, 'female')
(21, 'Babby John', 'Four', 69, 'female')
(22, 'Reggid', 'Seven', 55, 'female')
(23, 'Herod', 'Eight', 79, 'male')
(24, 'Tiddy Now', 'Seven', 78, 'male')
(25, 'Giff Tow', 'Seven', 88, 'male')
(26, 'Crelea', 'Seven', 79, 'male')
(27, 'Big Nose', 'Three', 81, 'female')
(28, 'Rojj Base', 'Seven', 86, 'female')
(29, 'Tess Played', 'Seven', 55, 'male')
(30, 'Reppy Red', 'Six', 79, 'female')
(31, 'Marry Toeey', 'Four', 88, 'male')
(32, 'Binn Rott', 'Seven', 90, 'female')
(33, 'Kenn Rein', 'Six', 96, 'female')
(34, 'Gain Toe', 'Seven', 69, 'male')
(35, 'Rows Noump', 'Six', 88, 'female')

In [12]:
q="SELECT id, name, class, mark, sex FROM student WHERE id=8 "
my_cursor=my_conn.execute(q)
data_row=my_cursor.fetchone()
print(data_row[0],data_row[1],data_row[3])

8 Asruid 85

In [14]:
# Show 10 records only
q="SELECT id, name, class, mark, sex FROM student limit 0,10"
my_cursor=my_conn.execute(q)
data_row=my_cursor.fetchall()
print(type(data_row))
print("No of records : ", len(data_row))
for row in data_row:
 print(row)

<class 'list'>
No of records :  10
(1, 'John Deo', 'Four', 75, 'female')
(2, 'Max Ruin', 'Three', 85, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(7, 'My John Rob', 'Five', 78, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(10, 'Big John', 'Four', 55, 'female')

In [15]:
# Delete sample table student
from sqlalchemy.exc import SQLAlchemyError
try:
 my_conn.execute('''DROP table student;''')
 print("student table deleted")
except SQLAlchemvError as e:
 #print(e)
 error=str(e.__dict_['orig'])
 print(error)

student table deleted

In [16]:
from sqlalchemy.exc import SQLAlchemyError
try:
     my_conn.execute('''
      CREATE TABLE IF NOT EXISTS student (id integer primary key,
      name text,
      class text,
      mark integer,
      sex text
      );''')

     print("Student Table created successfully")
except SQLAlchemyError as e:
   #print (e)
   error=str(e._dict_['orig'])
   print(error)

Student Table created successfully

In [17]:
from sqlalchemy import create_engine
my_conn = create_engine("sqlite:////content/my_db2.db")